Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportTypeEnum
The new area support options.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportTypeEnum.AREA_SUPPORT_NO
The "no" area support option.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportTypeEnum.AREA_SUPPORT_SIMPLE
The area support simple.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportTypeEnum.AREA_SUPPORT_FULL
The area support full.